Revit 2027 API
ModelText.Text Property
The text string in the model text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Text { get; set; }
Public Property Text As String
	Get
	Set
public:
property String^ Text {
	String^ get ();
	void set (String^ value);
}
member Text : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when null is assigned to text.
ArgumentException |  Thrown when an empty string is assigned to text.
See Also
Reference
ModelText Class
Autodesk.Revit.DB Namespace